BusinessProcesses/ВнутренниеПереводыПоЦА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>ВнутренниеПереводыПоЦА</Name>
			<Task>Task.ЗадачаИсполнителяПоСогласованиюПлатежей</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодписанПредседателем</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаДиректоромФДВыполнена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦС_СостоянияСогласованияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВнутреннихПереводов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурирующийЧП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаПередачаНаОплату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеКурирующимЧП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомментарииПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>История</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Платежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсНацбанка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсТекущегоБанка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалюте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийСогласующего</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/ЦС_АдресацияБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦС_АдресацияБизнесПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_ПодразделенияДляБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыВнутреннихПереводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыВнутреннихПереводов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутреннийПеревод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДополнительнойИнформацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДополнительнойИнформацииОбъектов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ХранилищеДополнительнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ХранилищеДополнительнойИнформации</Name>
			<Comment>Хранилище дополнительной информации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Comment>Вид данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительнойИнформацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДФайлаПочтовогоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеРазделенияДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BusinessProcesses/ВнутренниеПереводыПоЦА/Forms/ФормаБизнесПроцесса/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьКарту(Команда) // Обработчик команды формы 
	ОбновитьКартуСервер();  	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьКартуСервер() // Серверная контекстная процедура получения карты маршрута 
	// Конвертируем объект формы в объект бизнес-процесса
	ОбъектБП = РеквизитФормыВЗначение("Объект"); 
	// Вызываем метод получения карты маршрута текущего бизнес-процесса
	Карта = ОбъектБП.ПолучитьКартуМаршрута();      	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекущееСостояниеБП()
	ОбновитьКартуСервер();
	Если не ЗначениеЗаполнено(ТекущаяТочка) тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.ТочкаМаршрута,
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителяПоСогласованиюПлатежей КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &Ссылка
		|	И НЕ ЗадачаИсполнителя.Выполнена";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекущаяТочка 	= ВыборкаДетальныеЗаписи.точкамаршрута;
			Задача 			= ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если параметры.Свойство("Задача") тогда
		Задача 			= Параметры.Задача;
		ТекущаяТочка 	= Параметры.Задача.ТочкаМаршрута;	
	КонецЕсли;
	Если Параметры.Ключ.Пустая() тогда
		ПолучитьТекущееСостояниеБП();
		ПодготовитьФорму(ЭтаФорма);
	КонецЕсли;
		
	ТекущийИсполнитель = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


Процедура ОбновитьИсториюИзменений()
	
	ИсторияИсполнения = "";
	Комментарии.Очистить();
	Для Каждого СтрокаТЧ из Объект.КомментарииПроцесса Цикл
		ИсторияИсполнения = ИсторияИсполнения + Символы.ПС +"["+ СтрокаТЧ.Автор +"]"+ " *** " +СтрокаТЧ.Дата + Символы.Таб + СтрокаТЧ.Комментарий+Символы.ПС;	
	КонецЦикла;
	Макет = БизнесПроцессы.ВнутренниеПереводыПоЦА.ПолучитьМакет("Макет");
	Обл = Макет.ПолучитьОбласть("Заголовок");
	Комментарии.Вывести(Обл);
	Обл = Макет.ПолучитьОбласть("Строка");
	
	Для каждого СтрокаТЧ Из объект.КомментарииПроцесса Цикл
		Обл.Параметры.Заполнить(СтрокаТЧ);
		Комментарии.Вывести(Обл);
	КонецЦикла;
	
	
КонецПроцедуры
	

&НаКлиенте
Процедура ПлатежноеПоручениеНажатие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЗначение(ПлатежноеПоручение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПодготовитьФорму(Форма)
	         
	Объект 			= Форма.Объект;
	Элементы 		= Форма.Элементы;	
	ТекущаяТочка 	= Форма.ТекущаяТочка;
	Задача			= Форма.Задача;
	
	Если Объект.стартован 
		и не ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ТочкаМаршрута.РаботаСЗаявкойАвтором") тогда
		элементы.левая.толькопросмотр 		= истина;
		Элементы.правая.Толькопросмотр		= Истина;
				
	КонецЕсли;

	Если задача.Выполнена тогда
		Форма.ТолькоПросмотр = Истина;
		Сообщить("Текущий этап выполнен. Редактирование формы невозможно");
		возврат;
	КонецЕсли;
	Если объект.Завершен тогда
		Форма.ТолькоПросмотр = Истина;
		Форма.Элементы.Группа1.Видимость = ложь;
		
		Сообщить("Бизнес-процесс завершен. Редактирование формы невозможно");
		возврат;
	КонецЕсли;
	
	
	
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ТочкаМаршрута.СогласованиеСДиректоромФД")	тогда
		Элементы.ПроверкаДиректоромФДВыполнена.Доступность 		= истина;
	//ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ТочкаМаршрута.ПроверкаВР")				тогда
	//	Элементы.ПодписанПредседателем.Доступность 				= истина;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ТочкаМаршрута.РаботаСЗаявкойАвтором")
		или не ЗначениеЗаполнено(ТекущаяТочка) тогда
		Элементы.вернутьнадоработку.видимость 				= ложь;
		Элементы.ОтказатьВПоставленнойЗадаче.видимость 		= ложь;
	//ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ТочкаМаршрута.СозданиеПП")	тогда
	//	Элементы.ВыполнитьЭтап.Заголовок = "Ознакомлен";
	//	Элементы.ВернутьНаДоработку.Видимость = Ложь;
	//	Элементы.ОтказатьВПоставленнойЗадаче.Видимость = Ложь;

	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЭтап(Команда)
	ОбработатьБП("ОК");
	ОповеститьОбИзменении(ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ПустаяСсылка"));
	ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаИсполнителяПоСогласованиюПлатежей.ПустаяСсылка"));
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработку(Команда)
	ОбработатьБП("Возврат");// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВПоставленнойЗадаче(Команда)
	ОбработатьБП("Отказ");// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьБП(РезультатВозврата)
	
	Если не ОбработатьЭтап(РезультатВозврата) тогда
		Возврат;
	КонецЕсли;
	
	//-=-=
	Если Не РольДоступна("axm_ОтключитьКонтрольСоотвествияИсполнителейВСогласованиях")
		И глТекущийПользователь <> ЭтотОбъект.Задача.Пользователь Тогда
		Сообщить("На текущем этапе согласовывать должен " + ЭтотОбъект.Задача.Пользователь + "!");
		Возврат;
	КонецЕсли;
	//-=-=
	
	Если КомментарийИсполнителя <> "" тогда
		НС = объект.КомментарииПроцесса.Добавить();
		НС.Автор = ТекущийИсполнитель;
		НС.Дата = ТекущаяДата();
		НС.Комментарий = КомментарийИсполнителя ;
		НС.Этап = ТекущаяТочка;
	КонецЕсли;
	
	НоваяЗапись = Объект.Подписи.Добавить();
	НоваяЗапись.Дата				= ТекущаяДата();
	НоваяЗапись.Этап			    = ТекущаяТочка;
	НоваяЗапись.Автор				= Пользователи.ТекущийПользователь();

	Записать();
	
	
	Если не Задача.Пустая() тогда
		ВыполнитьЗадачу(Задача);
	Иначе
		Стартовать();
	КонецЕсли;
	ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаИсполнителяПоСогласованиюПлатежей.ПустаяСсылка"));
	Закрыть();	
	  
КонецПроцедуры

Процедура Стартовать()
	БП = РеквизитФормыВЗначение("Объект");
	БП.Старт();
	ЗначениеВРеквизитФормы(БП,"Объект");
КонецПроцедуры

&НаКлиенте
Функция ОбработатьЭтап(РезультатВозврата)
	
	Если РезультатВозврата = "ОК" тогда
		ЗначениеВозврата = Истина;
	ИначеЕсли РезультатВозврата = "Возврат" или РезультатВозврата = "Отказ" Тогда
		Если КомментарийИсполнителя = "" тогда
			Предупреждение("Не указана причина в комментарии текущего исполнителя");
			ЗначениеВозврата = Ложь;
		Иначе
			ЗначениеВозврата = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатВозврата = "ОК" тогда 
		ЗначениеПоля = "Разрешено";
	ИначеЕсли РезультатВозврата = "Возврат" Тогда
		ЗначениеПоля = "Возвращено";
	Иначе
		ЗначениеПоля = "Отказано";
	КонецЕсли;
		
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ТочкаМаршрута.СогласованиеСДиректоромФД")	тогда
		Объект.ПроверкаДиректоромФДВыполнена = ЗначениеПоля;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ТочкаМаршрута.СозданиеПП")				тогда
		Объект.ПроверкаПередачаНаОплату = ЗначениеПоля;
	//-=-=
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ТочкаМаршрута.СогласованиеСКурирующимЧП") Тогда
		Объект.ЗаявкаПрошлаСогласованиеКурирующимЧП = ЗначениеПоля;
	//-=-=
	КонецЕсли;	
	
	 Возврат ЗначениеВозврата;
	 
КонецФункции


&НаСервереБезКонтекста
Функция ВыполнитьЗадачу(Задача)
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПолучитьТекущееСостояниеБП();
	ПодготовитьФорму(ЭтаФорма);
	ОбновитьИсториюИзменений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦС_АдресацияБизнесПроцессов.Пользователь,
	|	ЦС_АдресацияБизнесПроцессов.Подразделение
	|ИЗ
	|	РегистрСведений.ЦС_АдресацияБизнесПроцессов КАК ЦС_АдресацияБизнесПроцессов
	|ГДЕ
	|	ЦС_АдресацияБизнесПроцессов.Пользователь = &глТекущийПользователь";
	
	Запрос.УстановитьПараметр("глТекущийПользователь", параметрысеанса.текущийпользователь);	
	
	ТолькоПросмотр								= истина;
	элементы.Группа1.Доступность				= Ложь;
	элементы.ФормаКоманднаяПанель.Доступность	= Ложь;	
	
	Если (Не ТекущийОбъект.стартован)
		Или параметрысеанса.текущийпользователь = Задача.Пользователь
		Или Запрос.Выполнить().Выгрузить().НайтиСтроки(Новый Структура("Пользователь, Подразделение", параметрысеанса.текущийпользователь, Задача.Подразделение)).Количество() <> 0
		Или РольДоступна("ПолныеПрава") тогда
		
		Если (НЕ ТекущийОбъект.Завершен) Тогда
			
			ТолькоПросмотр = ложь;
			элементы.Группа1.Доступность = Истина;
			элементы.ФормаКоманднаяПанель.Доступность = Истина;
		КонецЕсли;
		
	иначе
		Сообщить("Этап не предусматривает исполнение текущим пользователем. Форма заблокирована");
	КонецЕсли;
	
	//Если Параметры.Задача.Выполнена тогда
	//	ЭтаФорма.ТолькоПросмотр	= Истина;
	//	ЭтаФорма.Элементы.Группа1.Доступность = Ложь;
	//КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура БанковскийСчетКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = Справочники.БанковскиеСчета.ПолучитьФормуВыбора(,Элемент);
	              	
	ФормаСчета.Отбор.Владелец.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Владелец.Значение      = объект.Контрагент;
	ФормаСчета.Отбор.Владелец.Использование = Истина;
	
	Если не объект.ВалютаДокумента.Пустая() тогда
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Значение	= объект.ВалютаДокумента;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Использование = Истина;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.ВидСравнения  = ВидСравнения.Равно;
	КонецЕсли;    	
	
	ФормаСчета.РежимВыбора = Истина;
	объект.БанковскийСчетКонтрагента =ФормаСчета.ОткрытьМодально();

КонецПроцедуры

&НаСервере
Процедура БанковскийСчетОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = Справочники.БанковскиеСчета.ПолучитьФормуВыбора(,Элемент);
	
	ФормаСчета.Отбор.Владелец.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Владелец.Значение      = объект.Организация;
	ФормаСчета.Отбор.Владелец.Использование = Истина;
	ФормаСчета.ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Ложь;
	
	ФормаСчета.Отбор.Источникфинансирования.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Источникфинансирования.Использование = Истина;
	ФормаСчета.отбор.Источникфинансирования.Значение = Объект.источникфинансирования;
	
	Если не объект.ВалютаДокумента.Пустая() тогда
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Значение	= объект.ВалютаДокумента;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Использование = Истина;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.ВидСравнения  = ВидСравнения.Равно;
	КонецЕсли;    	
	
	ФормаСчета.РежимВыбора = Истина;
	объект.БанковскийСчетОрганизации = ФормаСчета.ОткрытьМодально();
	
// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭлементОтбора = СписокФайлов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
		
	Если Объект.Согласован = Истина И ТекущаяТочка <> ПредопределенноеЗначение("БизнесПроцесс.ВнутренниеПереводыПоЦА.ТочкаМаршрута.СозданиеПП") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;	
		Сообщить("Документ согласован и не может быть изменен");
	КонецЕсли;
	
	Если Объект.ТипПлатежа = Перечисления.ВидыВнутреннихПереводов.ВнутреннийПеревод Тогда
		ЭтаФорма.Элементы.ПлатежиКурсНацбанка.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКурсТекущегоБанка.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиСуммаВВалюте.Видимость = Ложь;
	Иначе
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокФайлов.ТекущаяСтрока;
	
	Если СокрЛП(ТекСтрока.Наименование) = "" Тогда
	 	СтандартнаяОбработка = Истина;
		Сообщить("Введите описание файла");
	Иначе
		СтандартнаяОбработка = Ложь;
		УниверсальныеМеханизмы.ОткрытьФайлы(Элементы.СписокФайлов.ТекущиеДанные, глТекущийПользователь, Элементы.СписокФайлов.ВыделенныеСтроки);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьФайла(ПолноеИмяФайла, Каталог)
	
	НовОбъектХранилища = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
	НовОбъектХранилища.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПолноеИмяФайла), Новый СжатиеДанных);
	НовОбъектХранилища.ИмяФайла = Сред(ПолноеИмяФайла, СтрДлина(Каталог) + 1);
	НовОбъектХранилища.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	НовОбъектХранилища.Объект = Объект.Ссылка;
	НовОбъектХранилища.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Диалог = УниверсальныеМеханизмы.ПолучитьДиалогВыбораФайлов(Ложь);
		
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;

	Попытка  		
		СоздатьЗаписьФайла(Диалог.ПолноеИмяФайла, Диалог.Каталог); 		
		Элементы.СписокФайлов.Обновить();
	Исключение
		Сообщить("" + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СписокФайлов.Отбор.Элементы.Очистить();
	ЭлементОтбора = СписокФайлов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры


&НаКлиенте
Процедура ТипПлатежаПриИзменении(Элемент)
	
	Если Объект.ТипПлатежа = Перечисления.ВидыВнутреннихПереводов.ВнутреннийПеревод Тогда
		ЭтаФорма.Элементы.ПлатежиКурсНацбанка.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКурсТекущегоБанка.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиСуммаВВалюте.Видимость = Ложь;
	Иначе
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПлатежиРасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Объект.Организация));
		
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлы(Команда)
		
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;

	ПараметрыФ = Новый Структура;
	ПараметрыФ.Вставить("ВладелецФайла", ТекСтрока.ЗаявкаНаФинансирование);
	Заголовок = НСтр("ru = 'Присоединенные файлы'");
	ПараметрыФ.Вставить("ЗаголовокФормы", Заголовок);
	
	ОткрытьФорму(
		"Справочник.Файлы.Форма.ФормаСпискаПрисоединенныхФайлов", 
		ПараметрыФ,
		ТекСтрока.ЗаявкаНаФинансирование, 
		ТекСтрока.ЗаявкаНаФинансирование, 
		);

КонецПроцедуры

&НаКлиенте
Процедура ПлатежиКурсТекущегоБанкаПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;

	Если ТекСтрока.Валюта.Наименование <> "KZT" Тогда
		ТекСтрока.СуммаВВалюте = ТекСтрока.СуммаПлатежа / ТекСтрока.КурсТекущегоБанка;
	Иначе
		ТекСтрока.СуммаВВалюте = ТекСтрока.СуммаПлатежа * ТекСтрока.КурсТекущегоБанка;
	КонецЕсли;
		
КонецПроцедуры
